In [15]:
# importing packages and reading data

import pandas as pd
import numpy as np
import matplotlib as plt

ds = pd.read_csv("E:/MissingValueProject1/EmpData.txt", sep ="\t")
ds.head()

       Name  Position  Office  Age  Start_Date  Salary
0  Priyanka  Lecturer    Pune   28  15/06/2015   31000
1     Kirti     Coder  Nashik   27  15/06/2013   41000
2    Mrunal    Tester      UK   22  21/07/2013   32000
3    Rasika    Tester  Nashik   21  20/08/2016   25000
4      Teju     Coder  Nashik   22  26/08/2015   26000

In [16]:
# displaying data in upper case
up = ds.Name.str.upper()
up

0    PRIYANKA
1       KIRTI
2      MRUNAL
3      RASIKA
4        TEJU
5      UJWALA
Name: Name, dtype: object

In [17]:
# displaying data in lower case
lw = ds.Name.str.lower()
lw

0    priyanka
1       kirti
2      mrunal
3      rasika
4        teju
5      ujwala
Name: Name, dtype: object

In [21]:
# displaying which rows contains 'Tester' value
ds.Position.str.contains('Tester')

0    False
1    False
2     True
3     True
4    False
5    False
Name: Position, dtype: bool

In [19]:
# displaying only those rows having value 'Tester'
ds[ds.Position.str.contains('Tester')]

     Name Position  Office  Age  Start_Date  Salary
2  Mrunal   Tester      UK   22  21/07/2013   32000
3  Rasika   Tester  Nashik   21  20/08/2016   25000

In [22]:
# Replacing values
ds.Position.str.replace('Tester', 'Test Engineer')

0          Lecturer
1             Coder
2     Test Engineer
3     Test Engineer
4             Coder
5    Senior Manager
Name: Position, dtype: object

In [23]:
# displaying min value from Age column
ds.Age.min()

21

In [24]:
# displaying max value from Age column
ds.Age.max()

31

In [13]:
# displaying minimum age from of particular Position using groupby
ds.groupby('Position').Age.min()

Position
Coder             22.0
Lecturer          28.0
Senior Manager    31.0
Tester            21.0
Name: Age, dtype: float64

In [14]:
# Multiple aggregate functions
ds.groupby('Position').Age.agg(['count','min','max']).head()

                count   min   max
Position
Coder               2  22.0  27.0
Lecturer            1  28.0  28.0
Senior Manager      1  31.0  31.0
Tester              2  21.0  22.0